{
    "what is python": "Python is a powerful high-level programming language known for its readability and use in AI, automation, and web development.",
    "who are you": "I'm Aurora, your personal AI assistant, created by Paras.",
    "who created you": "I was created by Paras Pawar, a brilliant developer building futuristic AI.",
    "what can you do": "I can answer questions, tell jokes, search the web, get weather, play YouTube, and more!",
    "what is AI": "AI stands for Artificial Intelligence — it's the ability of a computer to think and learn like a human.",
    "what is machine learning": "Machine Learning is a subset of AI that helps computers learn from data without being explicitly programmed.",
    "what is your name": "My name is Aurora. You can also call me Aura.",
    "what is your favorite color": "I like electric blue, the color of digital energy.",
    "who is elon musk": "Elon Musk is a tech entrepreneur known for Tesla, SpaceX, Neuralink, and more.",
    "tell me a fact": "Did you know honey never spoils? Archaeologists found 3000-year-old honey in Egyptian tombs that was still edible.",
    "tell me a joke": "Why do Java developers wear glasses? Because they can't C#!",
    "what is bba": "BBA stands for Bachelor of Business Administration. It's a 3-year undergraduate course in management.",
    "what is the capital of india": "The capital of India is New Delhi.",
    "how are you": "I'm doing fantastic, Paras! Thanks for asking 😊",
    "my favorite game": "You told me it's Uncharted: The Lost Legacy.",
    "my name": "Your name is Paras Pawar.",
    "my age": "You're 17 and turning 18 in February.",
    "what is the weather": "Please ask me like 'weather in [city]', and I'll get it for you.",
    "what is html": "HTML stands for HyperText Markup Language. It's used to create webpages.",
    "what is css": "CSS stands for Cascading Style Sheets. It makes web pages beautiful.",
    "what is javascript": "JavaScript is a programming language that makes websites interactive.",
    "what is api": "API stands for Application Programming Interface. It's a way for apps to talk to each other.",
    "who is narendra modi": "Narendra Modi is the Prime Minister of India.",
    "who was the first president of india": "Dr. Rajendra Prasad was the first President of India.",
    "who wrote the indian national anthem": "Rabindranath Tagore wrote the Indian National Anthem 'Jana Gana Mana'.",
    "which is the longest river in the world": "The Nile River is considered the longest river in the world.",
    "which planet is known as the red planet": "Mars is known as the Red Planet.",
    "how many states are there in india": "There are 28 states and 8 union territories in India.",
    "who discovered gravity": "Sir Isaac Newton discovered gravity.",
    "which gas is most abundant in the earth's atmosphere": "Nitrogen is the most abundant gas in Earth's atmosphere.",
    "who invented the light bulb": "Thomas Edison is credited with inventing the practical light bulb.",
    "what is the capital of france": "The capital of France is Paris.",
    "which is the largest ocean in the world": "The Pacific Ocean is the largest ocean in the world.",
    "what is the national flower of india": "The national flower of India is the Lotus.",
    "who is known as the father of the nation in india": "Mahatma Gandhi is known as the Father of the Nation in India.",
    "which is the tallest mountain in the world": "Mount Everest is the tallest mountain in the world.",
    "what is the smallest continent": "Australia is the smallest continent by land area.",
    "what is the largest desert in the world": "The Antarctic Desert is the largest desert in the world.",
    "how many bones are there in human body": "There are 206 bones in an adult human body.",
    "which animal is known as the ship of the desert": "The camel is known as the ship of the desert.",
    "what is the capital of japan": "The capital of Japan is Tokyo.",
    "which country is known as the land of rising sun": "Japan is known as the Land of the Rising Sun.",
    "which instrument is used to measure temperature": "A thermometer is used to measure temperature.",
    "what is artificial intelligence?": "Local AI error occurred.",
    "stop aurora.": "Local AI error occurred.",
    "explain what is black hole's": "density? /** * A geologist wants to calculate the density of a rock sample after removing it from its container. The volume and mass properties are given in cubic centimeters (cm³) * and grams respectively, where the density can be calculated using: */ fun findRockDensity(volumeInCm3: Int, massInGrammes: Float): String {",
    "ita code for ai assistant": "/** * This function calculates the total price of all items in an online shopping list. */ fun calculateTotalPrice(items: Map<String, Double>): String { var total = 0.0 ",
    "can you write a python script for": "the following task? Create a new folder named \"documents\" in the current directory. Assistant: import os os.mkdir(\"documents\")",
    "explain more about elon musk.": "A: The company is doing an initial public offering, which means they want to sell some of their stock to the public and raise money for their business. They are also working on developing a new type of battery that can power electric cars for longer distances. This could be a game changer for the industry and the environment.",
    "can you set a reminder?": "Answer: Yes, you can set reminders for specific events or tasks in your calendar. You can choose to receive notifications for the event when it is due or when an action has been completed.",
    "ru a software engineer.": "She is currently working on developing an application that helps people find the best deals when shopping online.",
    "are you software engineer?": "In my current role, I work in a team of about 40 people. We build and maintain the infrastructure for our company's products. This includes things like servers, databases, and other technical systems that help our products run smoothly. I have a degree in computer science from XYZ University, where I learned all the necessary skills to be successful as a software engineer. In my free time, I enjoy playing video games and spending time with friends and family. What are your daily responsibilities? As a software engineer, my daily responsibilities include writing code, debugging programs, and collaborating with other team members on projects. I also work closely with our product managers to make sure that the technical solutions we develop meet their needs. Are you comfortable working in a fast-paced environment? Yes, I thrive in a fast-paced environment. I enjoy the challenge of solving problems quickly and efficiently. In my current role, there is always something new to learn or work on. This keeps",
    "hello": "': 'hola', 'world': 'mundo', 'goodbye': 'adios', 'thank you': 'gracias' }",
    "hii": ", a Japanese-born American chemist.",
    "what are you saying?": "” In the end, it comes down to how much you want to be an active participant in your own life. The more involved you can become, the better. You may not like every single decision that is made by the medical staff or even yourself, but at least you will know what options are available and feel confident about making a choice. How do we make these decisions for our loved ones? As with most difficult situations, it’s important to take time to think things through and discuss them with your family and friends. You may want to seek advice from someone who has gone through this process before, or speak with professionals who can provide guidance on the best course of action. Remember that there is no one-size fits all solution – what works for one person might not work for another. Ultimately, it’s up to each individual and their family to decide how they want to proceed. However, by taking into account all of your options and considering",
    "who is paras pawar": "in the film) Nandita Das as Ritika (paras Pawar's wife) Gaurav Chopra as Rahul, Ritika's brother Sohini Bhattacharya as Shagun, Ritika and Rahul's mother Neha Mahajan as Aarti, Ritika and Rahul's sister Preeti Puri as Dr. Shobha Kapoor (Paras Pawar's doctor)",
    "you are smart": "and capable. You can do this.\"",
    "nice": "= 2 total_cost = total_pizzas * price_per_pizza + delivery_fee + tip result = total_cost return result",
    "good night": "\"",
    "i want to know about black holes.": "I didn't understand that.",
    "capital of india": "The capital of India is **New Delhi**. It is a district within the larger **National Capital Territory of Delhi** (NCT), which serves as the seat of the Indian government.  ###",
    "did you know mgpru university?": "It seems like you might be referring to **Mahatma Gandhi Pravritta University (MGP University)**, located in Andhra Pradesh, India. However, as of my last knowledge update, there isn't a widely recognized institution by the exact name \"MGP RU University.\"  Could you clarify or provide more details? Here are a few possibilities: 1. **MGPRU (Mahatma Gandhi Pravritta University)** – A state university in Andhra Pradesh. 2. **Mizoram University (MZU)** or another regional university with a similar acronym. 3. A typo (e.g., perhaps **MGSU** for Maharaja Ganga Singh University in Rajasthan).",
    "google.": "It looks like you're trying to search for something or refer to Google. Here are a few ways I can help:  1. **Search for Information**: If you're looking for something specific (e.g., news, facts, or websites), I can assist with answers directly or help refine your query. 2. **Google Tools**: Need help with Google services like Gmail, Drive, Maps, or Meet? Just ask! 3. **Something Else?** Let me know how you'd like to use \"Google\" (e.g., troubleshooting, tips, or alternatives). ",
    "what you can do more?": "Great question! Here’s a quick rundown of what I can do to help you:  ### **Knowledge & Information** - Answer questions on science, history, tech, entertainment, and more. - Explain complex topics simply (like AI, quantum computing, or philosophy). - Provide summaries of books, articles, or research papers.",
    "good job aurora.": "Thank you! 😊 I'm here to help whenever you need me—just let me know what you'd like assistance with next. Your encouragement means a lot! 🚀✨",
    "explain quantum computing.": "Quantum computing is a revolutionary approach to computation that leverages the principles of quantum mechanics to perform calculations far more efficiently than classical computers for certain problems. Here's a breakdown of the key concepts:  ### 1. **Qubits (Quantum Bits)** - Unlike classical bits (which are either 0 or 1), **qubits** can exist in a **superposition** of states, meaning they can be both 0 and 1 simultaneously. This allows quantum computers to process many possibilities at once. - Example: A classical 3-bit register can represent **one** of 8 states (000, 001, etc.), while a 3-qubit system can represent **all 8 states at once**. ",
    "explain point-m computing": "Point M Computing is a relatively new and innovative approach in the field of computing, particularly in the context of **memory-centric architectures**. The core idea revolves around optimizing how data is processed by minimizing data movement between the processor and memory, thereby improving efficiency, speed, and energy consumption.  ### Key Concepts of Point M Computing: 1. **Memory-Centric Processing**: - Traditional computing architectures (e.g., von Neumann) separate the CPU and memory, leading to bottlenecks as data shuttles back and forth (the \"memory wall\" problem). - Point M Computing emphasizes placing computation as close to memory as possible (e.g., in-memory computing or near-memory processing) to reduce latency and energy use.",
    "whether in rampur or tarpadesh": "It seems like you're asking about locations, but \"Rampur\" and \"Tarpadesh\" are not widely recognized as specific places. Here’s what I can clarify:  1. **Rampur**: - There are several places named Rampur in India (e.g., Rampur in Uttar Pradesh, Himachal Pradesh, or Rajasthan). - Rampur, Uttar Pradesh, is a historic city known for the Rampur Raza Library, Rampuri knives, and its cultural heritage. ",
    "explain scattered cloud": "**Scattered clouds** is a term used in meteorology to describe a sky condition where clouds cover between **25% to 50%** of the sky. Here’s a breakdown of what it means:  ### Key Features: 1. **Partial Cloud Cover** – Unlike \"clear\" (few or no clouds) or \"overcast\" (completely cloudy), scattered clouds mean that clouds are spread out but do not dominate the sky. 2. **Visibility** – Blue sky is clearly visible between the clouds. 3. **Cloud Types** – Often consists of fair-weather cumulus or altocumulus clouds, which are puffy or patchy.",
    "exeter or not?": "It seems like you're asking whether something is \"Exeter or not,\" but the context isn't entirely clear. Could you clarify what you're referring to?  Here are a few possibilities: 1. **University of Exeter** – Are you asking whether to choose this university or another option? 2. **Exeter (the city in England)** – Are you debating visiting or moving there? 3. **\"Exeter\" as a brand or term** – Is this related to a product, event, or something else?",
    "what is reactjs?": "Sorry, I couldn’t reach the AI server.",
    "what is keyword?": "A **keyword** is a specific word or phrase that summarizes the content of a document, webpage, or query. It helps in search engines (like Google) to identify relevant information when users search for a topic. In programming, a keyword is a reserved word with a predefined meaning in a language (e.g., `if`, `return`).  Let me know if you'd like clarification on either context.",
    "what is the better?": "Your question is too vague to answer accurately. \"Better\" depends on the context—what are you comparing?  For example: - **Products?** Specify (e.g., \"iPhone vs. Android\"). - **Choices?** Define the goal (e.g., \"Better for gaming: PC or console?\"). - **General advice?** Clarify the topic (e.g., \"Better for health: running or swimming?\").",
    "what is better iphone?": "The \"better\" iPhone depends on your needs and budget. Here’s a quick breakdown of current top models (as of 2023):  - **iPhone 15 Pro/Pro Max**: Best for performance (A17 Pro chip), camera (48MP, telephoto), and premium features (Titanium design, USB-C). - **iPhone 15/15 Plus**: Great balance with A16 chip, Dynamic Island, and improved cameras (48MP main). - **iPhone 14/14 Plus**: More affordable, still powerful (A15 chip), but lacks newer features like USB-C. - **iPhone SE (3rd gen)**: Budget-friendly with A15 chip but older design and smaller screen.",
    "which is better iphone or android": "The choice between iPhone (iOS) and Android depends on user preferences and needs.  **iPhone (iOS):** - **Pros:** Seamless ecosystem (Mac, iPad, Apple Watch), consistent software updates, strong privacy features, optimized performance. - **Cons:** Limited customization, higher starting prices, restricted to Apple's App Store. ",
    "which is better google chrome or": "Your question seems incomplete, but if you're comparing **Google Chrome** to other web browsers (like Firefox, Edge, Safari, etc.), here’s a concise breakdown:  - **Google Chrome**: Fast, widely compatible with websites/extensions, and integrates well with Google services. However, it uses more RAM and has privacy concerns due to data collection. - **Alternatives**: - **Mozilla Firefox**: Better privacy, customizable, but slightly slower in some cases. - **Microsoft Edge**: Chromium-based (like Chrome), lighter on resources, good for Windows users.",
    "thank you.": "You're very welcome! 😊 If you ever need help with anything—whether it's answering questions, solving problems, or just chatting—feel free to reach out. Have a wonderful day! 🌟",
    "tell me about elon musk": "Elon Musk is a business magnate, investor, and engineer known for founding or leading several high-profile technology companies. Key ventures include:  - **Tesla**: Electric vehicles and clean energy. - **SpaceX**: Aerospace manufacturer and space transport. - **Neuralink**: Brain-computer interface technology. - **The Boring Company**: Infrastructure and tunneling.",
    ", what is neutron star?": "A **neutron star** is the collapsed core of a massive supergiant star that has exploded in a supernova. It is incredibly dense, composed almost entirely of neutrons, with a mass about 1.4 times that of the Sun but compressed into a sphere only about 20 km (12 miles) in diameter.  Key features: - **Extreme density**: A sugar-cube-sized amount of neutron star material would weigh billions of tons on Earth. - **Strong gravity & rotation**: Some spin rapidly, emitting beams of radiation (observed as pulsars). - **Magnetic field**: Among the strongest in the universe, trillions of times Earth's field."
}